{
"home": {
	"title": "National Gallery - CIDOC CRM Modelling Examples",
	"content": "<h3>Integrating documentation details and analytical data generated for an object</h3><br/><p>In order to connect existing work together and to identify where the development of practical examples of documentation software could be most informative, the relationships between the various types of documentary and analytical data generated for generic and specific situations need to be described. This presentation provides examples of how real objects can be semantically described and linked to the images and results of their analytical examination.</p><center><a class=\"btn btn-outline-primary nav-button\" style=\"left:80px;\" id=\"nav-models\" role=\"button\" href=\"models.html\">Explore Models</a></center><br/><p><a href=\"http://www.cidoc-crm.org\"><img style=\"position:relative;width:75px;float:left;margin-right:5px;\" src=\"graphics/cidoccrm_logo.png\"/></a>All of the linking properties and classes presented in the included examples are taken from the current[@@] release and development version of the CIDOC-CRM[@@] ontology. References to external control vocabularies or thesauri[@@] have also been included to demonstrate how links between internal documentation systems and external resources could be modelled.</p>",
	"footnotes": [
		"January 2020",
		"The CIDOC Conceptual Reference Model (CRM) is a theoretical and practical tool for information integration in the field of cultural heritage. - http://www.cidoc-crm.org . Current versions of the CIDOC CRM can be found at http://www.cidoc-crm.org/versions-of-the-cidoc-crm.",
		"The two main external LOD vocabularies/thesauri referenced in this document are the Getty’s AAT ( http://www.getty.edu/research/tools/vocabularies/aat ) and Wikidata ( https://www.wikidata.org )"],
	"content right": "<img style=\"position:relative;width:100%;\" src=\"graphics/example_knowledge_graph.png\"/>"
	},
"models": {
	"title": "National Gallery - CIDOC CRM Modelling Examples",
	"content": "<b>This presentation does not cover all the possible relationships relating to conservation documentation but concentrates on examples of the main properties and values required to document and organise technical and analytical examinations of cultural heritage objects.</b> Therefore, the semantic description of objects, their creators and common events will be minimal and will not explore the additional concepts more specifically related to detailed conservation treatments, art history, provenance or exhibitions. However, in addition to the demonstrating the semantic relationships between data types the examples included in this document have been extended to demonstrate how real literal values, numbers, dates, names and text can be connected to the semantic model. The data included in this deliverable has been taken from the online <a href=\"https://cima.ng-london.org.uk/documenttion\">Raphael Research Resource</a>.</p><p>In the following examples each of the sets of relationships are presented in the form of a flow diagram, which indicates and explains the entities being linked together and the properties connecting them. At this time each flow diagram can be rendered in two different ways: one using an interactive 3D display (<a href=\"https://github.com/nylen/d3-process-map\">D3 Process Map</a>) and one using a simpler 2D presentation (<a href=\"https://github.com/mermaid-js/mermaid\">Mermaid</a>).",
	"footnotes": [],
	"content right": ""
	},
"data": {
	"title": "National Gallery - CIDOC CRM Modelling Examples",
	"content": "<h2>Data preparation</h2><p>This site has been setup to present a series of examples of how the CIDOC CRM can be used to model actual heritage data, however it is not meant to be a static resource. The models that are presented here are expected to change overtime as a result of further research and discussion and potentially new models may be added. The goal is to create a resource that aims to present a <i>current</i> view of the consensus of how the CIDOC CRM is used to model data in practical systems.</p><p>In order to make the process of editing the models as easy as possible they are created dynamically from a simple list of tab separated triples as shown here. Simple changes to this root data file will result in the presented models changing, as all of the required processing and formatting, for these complex presentations, are carried out automatically each time a model is loaded.</p><p>In order to allow others to participate in future discussions, and help update these models, the raw files are going to be uploaded to <a href=\"https://github.com/jpadfield/cidoc-crm.examples\">GitHub</a>. This will allow details of all issues, comments and even older versions of the models to be publicly organised and presented.</p><center><a href=\"https://github.com/jpadfield/cidoc-crm.examples\"><img style=\"position:relative;width:150px;\" src=\"graphics/github logo.png\"/></a></center>",
	"footnotes": [],
	"content right": "<pre style=\"overflow: hidden;border: 2px solid black;padding: 10px;\">\n////////////////////////////////////////////////////////////////////////\n// Model: artist // Primary relationships describing an Artist\n// D8.5 Figure 4\n////////////////////////////////////////////////////////////////////////\nng:0F6J-0001-0000-0000\tcrm:P2.has type\tcrm:E21.Person\taPID@@crm\nng:0F6J-0001-0000-0000\tcrm:P2.has type\taat:300411314\naat:300411314\trdfs:label\tartist painters@en\nng:0F6J-0001-0000-0000\tcrm:P2.has type\taat:300024987\naat:300024987\trdfs:label\tarchitechts@en\nng:0F6J-0001-0000-0000\towl:sameAs\tulan:500023578\nulan:500023578\trdfs:label\tRaphael@en\nng:0F6J-0001-0000-0000\towl:sameAs\twd:Q5597\nwd:Q5597\trdfs:label\tRaphael@en\nng:0F6J-0001-0000-0000\trdfs:seeAlso\thttps://cima.ng-london.org.uk/documentation\nhttps://cima.ng-london.org.uk/documentation\trdfs:label\tRaphael Research Resource@en\nng:0F6J-0001-0000-0000\trdfs:comment\tFree Text@en\nng:0F6J-0001-0000-0000\tcrm:P14.performed\tngo:002-0432-0000\taPID@@ePID\n\n_Blank Node\tcrm:P2.has type\tcrm:E41.Appellation\nng:0F6J-0001-0000-0000\tcrm:P131.is identified by\t_Blank Node\n_Blank Node\trdfs:label\tRaphael@en\n\n_Blank Node\tcrm:P2.has type\tcrm:E74.Group\taPID@@crm\nng:0F6J-0001-0000-0000\tcrm:P15.was influenced by\t_Blank Node\n_Blank Node\towl:sameAs\taat:300107304\naat:300107304\trdfs:label\tAncient Italian@en\n\n_Blank Node\tcrm:P2.has type\tcrm:E67 Birth\tevent@@crm\nng:0F6J-0001-0000-0000\tcrm:P98.was born\t_Blank Node\n\n_Blank Node\tcrm:P2.has type\tcrm:E53 Place\n_Blank Node-1\tcrm:P7.took place at\t_Blank Node\n_Blank Node\towl:sameAs\ttgn:7003994\n_Blank Node\towl:sameAs\twd:Q2759\ntgn:7003994\trdfs:label\tUrbino (inhabited place)@en\n</pre>"
	},
"about": {
	"title": "National Gallery - CIDOC CRM Modelling Examples",
	"content": "<p>Conservation and Heritage Science documentation are overarching terms used to cover the description and record of any relevant materials, activities, processes, people, places, and events involved in the history of a cultural heritage object. Cataloguing an object’s composition, condition and how it has degraded or been damaged overtime, along with all the work that has been done to retard, treat and study this degradation process. So, this work can cover the full range of historic activities right up to the ever-increasing detail and complexity of modern scientific analytical techniques. The amount of time and expertise needed to record everything in a meaningful and re-usable fashion can rapidly progress past the level that is realistic for the many different specialists working in this field. A balance must be established between the effort and time required and the future benefit of the recorded information; key to this process is making use of appropriate tools to maximise the efficiency of the documentation process.</p><p>Over the last decade large amounts of time and money have been invested in the development of conservation-related documentation systems[@@] and digital tools[@@], to help with this documentation process. Some of this work has taken place within specific institutions while other larger projects, most notably the Andrew W. Mellon Foundation funded ConservationSpace[@@] and ResearchSpace[@@] projects, have been developed through multi-institutional collaborations. However, these new tools and systems are often developed for specific purposes and can still require a fair amount of technical know-how or support to implement, populate and access. Also, even with all this work, many specialists in the field are still using simple digital file folders or are stuck with older institution-specific databases that struggle to meet their current requirements. In many cases people are also still working with analogue filling systems.</p><p>Additional research is often required to provide a bridge between current working practice and new, complete integrated digital solution. The work presented here was carried out to provide a range of worked, practical examples of how data gathered during the study and examination of heritage objects can be described in relation to the CIDOC CRM[@@] ontology, to aid with future data mapping and data interoperability processes.</p><p>The CIDOC CRM has continued to undergo development during this project, the references included in this document have been updated to try to reflect the latest draft version at the time of writing, which was version 6.2.7[@@]. In addition to the development of the core CRM and number of additional compatible models[@@] have been developed to provide additional ontological models for specific areas of research. The work presented in this deliverable could overlap with several of these extensions, particularly the CRMsci[@@], which is being developed to help model scientific observations. However, as this CRMsci extension is still under active development it was decided that the work included in this deliverable would be limited to the core CRM ontology. This was done to examine how flexible the main standard could be and to help highlight where new simplifications or clarifications could enhance the included models.</p><p>The work presented here is also intended to develop and evolve over time to reflex input from the wider semantic community, with new versions of the model being included to correct for any identified issues or errors and improve the scope of the examples provided.</p><p><b><i>The initial work of creating the semantic models was carried out as part of the IPERION-CH H2020 project[@@], but the reformatting of the models and the creation of this web resource has been carried out as part of the SSHOC H2020 project[@@].</i></b></p><p><img src=\"graphics/iperion-ch-eu-tag2.png\" style=\"height:32px;\"><img src=\"graphics/sshoc-eu-tag2.png\" style=\"height:32px;\"></p>",
	"footnotes": [
		"http://www.rembrandtdatabase.org/, http://www.lucascranach.org/, http://boschproject.org/, http://cima.ng-london.org.uk/documentation (Raphael Research Resource).",
		"Such as Image viewers (e.g. http://iiif.io/), ontologies (e.g. http://www.cidoc-crm.org/) and open linked vocabularies (e.g. http://www.getty.edu/research/tools/vocabularies/lod/).",
		"http://www.conservationspace.org/, https://sites.google.com/site/conservationspace/",
		"http://www.researchspace.org/",
		"<b>The CIDOC Conceptual Reference Model (CRM) is a theoretical and practical tool for information integration in the field of cultural heritage.</b> - http://www.cidoc-crm.org/.",
		"http://www.cidoc-crm.org/Version/version-6.2.7",
		"http://www.cidoc-crm.org/collaborations",
		"http://www.cidoc-crm.org/crmsci/",
		"<b>IPERION CH Integrated Platform for the European Research Infrastructure ON Cultural Heritage</b> - http://www.iperionch.eu/. This intial work was published as part of one of the project deliverables - <b>IPERION CH Delivaerable D8.5 - Completed example of prototype designs for integration of various types of documentation and analytical data generated for a single object</b> - https://ec.europa.eu/research/participants/documents/downloadPublic?documentIds=080166e5c8d1c525&appId=PPGMS",
		"<b>SSHOC - Social Sciences & Humanities Open Cloud</b> - https://sshopencloud.eu/"
		],
	"content right": ""		
	}
}
